; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p17---int100n150-m25---int100c110---s448---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level22 level22)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level22 level23)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level22 level24)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level22 level25)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level21 level4 level25)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l2)
(fuelcost level22 l1 l2)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l1)
(fuelcost level22 l2 l1)

(at t0 l1)
(fuel t0 level19)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l2)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l0)
(at p7 l0)
(at p8 l1)
(at p9 l2)
(at p10 l2)
(at p11 l1)
(at p12 l0)
(at p13 l1)
(at p14 l1)
(at p15 l0)
(at p16 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l0)
(at p3 l0)
(at p4 l1)
(at p5 l2)
(at p6 l2)
(at p7 l1)
(at p8 l2)
(at p9 l1)
(at p10 l0)
(at p11 l0)
(at p12 l1)
(at p13 l0)
(at p14 l2)
(at p15 l2)
(at p16 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 17
2. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 17
3. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 17
4. (load p16 t0 l1)
   deleted: (at p16 l1)
   added: (in p16 t0)
   goals met: 0 of 17
5. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 0 of 17
6. (load p13 t0 l1)
   deleted: (at p13 l1)
   added: (in p13 t0)
   goals met: 0 of 17
7. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 0 of 17
8. (drive t0 l1 l0 level14 level5 level19)
   deleted: (at t0 l1) (fuel t0 level19)
   added: (at t0 l0) (fuel t0 level14)
   goals met: 0 of 17
9. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 17
10. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 17
11. (load p15 t0 l0)
   deleted: (at p15 l0)
   added: (in p15 t0)
   goals met: 0 of 17
12. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 0 of 17
13. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 17
14. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 17
15. (drive t0 l0 l2 level10 level4 level14)
   deleted: (at t0 l0) (fuel t0 level14)
   added: (at t0 l2) (fuel t0 level10)
   goals met: 0 of 17
16. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 0 of 17
17. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 17
18. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 17
19. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 17
20. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 1 of 17
21. (unload p14 t0 l2)
   deleted: (in p14 t0)
   added: (at p14 l2)
   goals met: 2 of 17
22. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 3 of 17
23. (unload p16 t0 l2)
   deleted: (in p16 t0)
   added: (at p16 l2)
   goals met: 4 of 17
24. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 5 of 17
25. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 6 of 17
26. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 7 of 17
27. (drive t0 l2 l0 level6 level4 level10)
   deleted: (at t0 l2) (fuel t0 level10)
   added: (at t0 l0) (fuel t0 level6)
   goals met: 7 of 17
28. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 8 of 17
29. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 9 of 17
30. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 10 of 17
31. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 11 of 17
32. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 12 of 17
33. (drive t0 l0 l1 level1 level5 level6)
   deleted: (at t0 l0) (fuel t0 level6)
   added: (at t0 l1) (fuel t0 level1)
   goals met: 12 of 17
34. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 13 of 17
35. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 14 of 17
36. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 15 of 17
37. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 16 of 17
38. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 17 of 17
